/***********************************************************
*文件名     : db_api.h
*版   本   : v1.0.0.0
*日   期   : 2018.05.03
*说   明   : 数据库相关操作接口
*修改记录: 
************************************************************/


#ifndef DB_API_H
#define DB_API_H

#include "sqlite3.h"

/*数据库条目最大长度*/
#define DB_DATA_MAX_LEN 128
/*SQL语句最大长度*/
#define DB_SQL_MAX_LEN 1024

typedef sqlite3 DB;

typedef struct db_data_entry_s
{
	char acData[DB_DATA_MAX_LEN];
}db_data_entry_t;

/*************************************************************
*函数:	db_open
*参数:	pcPath :数据库文件路径
*		db :数据库文件指针
*返回值:0表示成功，非0表示失败
*描述:	打开数据库
*************************************************************/
extern int 
db_open(char *pcPath, DB**db);

/*************************************************************
*函数:	db_close
*参数:	pcPath :数据库文件路径
*返回值:0表示成功，非0表示失败
*描述:	关闭数据库
*************************************************************/
extern int 
db_close(DB**db);

/*************************************************************
*函数:	db_add
*参数:	db :数据库文件指针
*		pcSql:数据库语句
*返回值:0表示成功，非0表示失败
*描述:	数据库增加条目
*************************************************************/
extern int 
db_add(DB*db, const char *pcSql);
/*************************************************************
*函数:	db_del
*参数:	db :数据库文件指针
*		pcSql:数据库语句
*返回值:0表示成功，非0表示失败
*描述:	数据库删除条目
*************************************************************/
extern int 
db_del(DB*db, const char *pcSql);

/*************************************************************
*函数:	db_set
*参数:	db :数据库文件指针
*		pcSql:数据库语句
*返回值:0表示成功，非0表示失败
*描述:	修改数据库条目
*************************************************************/
extern int 
db_set(DB*db, const char *pcSql);

/*************************************************************
*函数:	db_get
*参数:	db :数据库文件指针
*		pcSql:数据库语句
*返回值:0表示成功，非0表示失败
*描述:	查询数据库条目
*************************************************************/
extern int 
db_get(DB*db, const char *pcSql, db_data_entry_t *pstData, int* piRow, int* piRank);




#endif /* DB_API_H */

